documents/images/graphio/stdlib/contrast_color4.dot
digraph {
  rankdir = LR;
    NG_contrast_color4_N_add_color4 [label= "add"];
    NG_contrast_color4_N_add_color4[shape = box];
    NG_contrast_color4_N_add_color4 ->     NG_contrast_color4_out;
    NG_contrast_color4_out [label= "out"];
    NG_contrast_color4_out[shape = box]; 
    NG_contrast_color4_pivotINT [label="pivot"];
    NG_contrast_color4_pivotINT [shape = ellipse];
    NG_contrast_color4_N_add_color4 [label="add"];
    NG_contrast_color4_pivotINT -> NG_contrast_color4_N_add_color4 [label=".in2"];
    NG_contrast_color4_N_mul_color4 [label= "multiply"];
    NG_contrast_color4_N_mul_color4[shape = box];
    NG_contrast_color4_N_mul_color4 ->     NG_contrast_color4_N_add_color4 [label= "in1"];
    NG_contrast_color4_N_add_color4 [label= "add"];
    NG_contrast_color4_N_add_color4[shape = box]; 
    NG_contrast_color4_amountINT [label="amount"];
    NG_contrast_color4_amountINT [shape = ellipse];
    NG_contrast_color4_N_mul_color4 [label="multiply"];
    NG_contrast_color4_amountINT -> NG_contrast_color4_N_mul_color4 [label=".in2"];
    NG_contrast_color4_N_sub_color4 [label= "subtract"];
    NG_contrast_color4_N_sub_color4[shape = box];
    NG_contrast_color4_N_sub_color4 ->     NG_contrast_color4_N_mul_color4 [label= "in1"];
    NG_contrast_color4_N_mul_color4 [label= "multiply"];
    NG_contrast_color4_N_mul_color4[shape = box]; 
    NG_contrast_color4_inINT [label="in"];
    NG_contrast_color4_inINT [shape = ellipse];
    NG_contrast_color4_N_sub_color4 [label="subtract"];
    NG_contrast_color4_inINT -> NG_contrast_color4_N_sub_color4 [label=".in1"];
    NG_contrast_color4_pivotINT [label="pivot"];
    NG_contrast_color4_pivotINT [shape = ellipse];
    NG_contrast_color4_N_sub_color4 [label="subtract"];
    NG_contrast_color4_pivotINT -> NG_contrast_color4_N_sub_color4 [label=".in2"];
}
